[
{
    "model": "news.newsmodel",
    "pk": 1,
    "fields": {
        "header": "US Supreme Court hears arguments on Trump's order to end birthright citizenship",
        "preview": "uploads/news/3723dd70-30d5-11f0-b5da-71555b1343d7.jpg.webp",
        "content": "US President Donald Trump took his bid to end birthright citizenship to the US Supreme Court on Thursday, in a case that could help further his agenda on immigration and other issues.\r\nThe case asks whether lower court judges should be able to block presidential orders for the entire country - as they have done in this case. The justices did not appear to reach a consensus as they considered both sides.\r\n\r\nThe US solicitor general argued that lower courts overstepped their authority, saying this power should be curtailed.\r\n\r\nMeanwhile, the New Jersey solicitor general - arguing on behalf of a group of states - said siding with Trump would create a patchwork system of citizenship.\r\nThis would create \"chaos on the ground\", argued the lawyer, Jeremy Feigenbaum.\r\nIt is not clear when the court will issue its decision. If it agrees with Trump, then he could continue his wide-ranging use of executive orders to make good on campaign promises without having to wait for congressional approval - with limited checks by the courts.\r\nJustices across the ideological spectrum seemed to grapple with two issues during Thursday's two-hour hearing.\r\nThere was questioning of lower courts' power to block a presidential order nationwide. And the justices also considered the merits of the birthright citizenship order itself - which critics argue violates the 14th Amendment of the US Constitution and Supreme Court precedent.\r\nUS Solicitor General D John Sauer, arguing on behalf of the Trump administration, said the current system \"required judges to make rushed, high-stakes, low-information decisions\".\r\nThe justices grilled Sauer for over an hour, with liberal Justice Elena Kagan noting that the administration had lost on the birthright citizenship issue in every lower court. \"Why would you ever take this case to us?\" she asked.\r\n\r\nIn response, Sauer said a class-action lawsuit - which allow large numbers of plaintiffs to sue together - could provide one avenue. But the process could often be time-consuming and did not provide relief in emergency circumstances, he said.\r\nJustice Samuel Alito, one of the court's most prominent conservatives, appeared critical of the lower court's power to issue nationwide injunctions.\r\n\"Sometimes they're wrong,\" he said, adding that some lower court judges were \"vulnerable to an occupational disease, which is the disease of thinking that I am right, and I can do whatever I want.\"\r\nFeigenbaum, arguing on behalf of states alleging harm from the executive order, said siding with the Trump administration on this matter would be impractical and unconstitutional.\r\nEliminating the option for nationwide injunctions could create a patchwork citizenship system, he argued, where an individual could have status in one state, but lose it when crossing into another.\r\nFeigenbaum said this standard would have a harmful impact distribution of government benefits like Medicaid, immigration enforcement, and maintaining accurate statistics.\r\n\"Since the 14th Amendment, our country has never allowed American citizenship to vary based on the state in which someone resides,\" Feigenbaum said.\r\nAs the justices lobbed questions at the lawyers, a large group of protesters gathered outside to voice opposition to Trump's immigration policies.\r\nCongresswoman Nancy Pelosi, the former speaker of the House of Representatives, joined the demonstrators outside and read from the US Constitution.\r\n\"This is about birthright, it's about citizenship, it's about due process,\" she said.\r\nTrump has vowed to end birthright citizenship. Can he do it?\r\nIt is unusual for the Supreme Court to hold a hearing in May, and there is no indication of when it may rule. Trump appointed three of the nine justices on the conservative-majority court in his first term.\r\nMany legal experts say the president does not have the power to end birthright citizenship because it is guaranteed by the 14th Amendment of the US Constitution. So, even if Trump wins the current case, he may still have to fight off other legal challenges.\r\nSpecifically, the 14th Amendment stipulates that \"all persons born or naturalised in the United States, and subject to the jurisdiction thereof, are citizens\".\r\nIn the executive order, Trump argued that the phrase \"jurisdiction thereof\" meant that automatic citizenship did not apply to the children of undocumented immigrants, or people in the country temporarily.",
        "created_at": "2025-05-15T18:12:53.633Z",
        "updated_at": "2025-05-15T18:27:26.886Z"
    }
},
{
    "model": "news.resourcemodel",
    "pk": 1,
    "fields": {
        "link": "https://www.bbc.com/news/articles/cm2yer83120o",
        "news": 1
    }
}
]
